//==========================================================
// [animUI.cpp]
//----------------------------------------------------------
// 作成:2023/06/08
// 
//==========================================================

#include <GameSystem/DarkGame/animUI.h>

using namespace DarkGame;

//==========================================================
// コンストラクタ
//==========================================================
CAnimeUI::CAnimeUI()
{

}

//==========================================================
// コンストラクタ
//==========================================================
CAnimeUI::CAnimeUI(CGameObject::Ptr ptr)
	:CComponent(ptr), m_fAnimationTime(2.0f), m_bIsAnim(false)
{

}

//==========================================================
// 生成時処理
//==========================================================
void CAnimeUI::Awake()
{
	m_pPolygon = AddComponent<CPolygonRenderer>();
}

//==========================================================
// 初期化
//==========================================================
void CAnimeUI::Init()
{

}

//==========================================================
// 更新
//==========================================================
void CAnimeUI::Update()
{
	if (m_bIsAnim)
	{
		auto color = m_pPolygon.lock()->GetColor();
		color.a -= 1.0f / m_fAnimationTime;
		m_pPolygon.lock()->SetColor(color);
		if (color.a < 0.0f)
		{
			m_bIsAnim = false;
		}
	}
}

//==========================================================
// ｱﾆﾒｰｼｮﾝ開始
//==========================================================
void CAnimeUI::StartAnim()
{
	m_bIsAnim = true;

	// 透明度を
	auto color = m_pPolygon.lock()->GetColor();
	color.a = 1.0f;
	m_pPolygon.lock()->SetColor(color);
}

//==========================================================
// ｱﾆﾒｰｼｮﾝ中か確認
//==========================================================
bool CAnimeUI::IsAnim()
{
	return m_bIsAnim;
}

