//==========================================================
// [darkPlayer.cpp]
//----------------------------------------------------------
// 作成:2023/05/21 cpp実装
// 
//==========================================================

//--- インクルード部
#include <GameSystem/DarkGame/darkPlayer.h>

using namespace DarkGame;

//==========================================================
// コンストラクタ
//==========================================================
CDarkPlayer::CDarkPlayer()
{

}

//==========================================================
// 引数付きコンストラクタ
//==========================================================
CDarkPlayer::CDarkPlayer(CGameObject::Ptr ptr)
	:CMoveCharacter(ptr)
{

}

//==========================================================
// デストラクタ
//==========================================================
CDarkPlayer::~CDarkPlayer()
{

}

//==========================================================
// 生成時処理
//==========================================================
void CDarkPlayer::Awake()
{
	// タグの設定
	CTag::CreateTag(CDarkPlayer::TAG);
	GetOwner()->SetObjTag(CDarkPlayer::TAG);

	m_pLightCol = AddComponent<CLightCollisionRegistry>();
}

//==========================================================
// 更新
//==========================================================
void CDarkPlayer::Update()
{

}

//==========================================================
// 遅い更新
//==========================================================
void CDarkPlayer::LateUpdate()
{
	LPCSTR tags[] = {
		"Enemy",
		"Obstacle",
	};

	for (int cnt = 0; cnt < _countof(tags); cnt++)
	{
		if (m_pLightCol.lock()->IsRange(tags[cnt]))
		{
			if (tags[cnt] == "Enemy")
			{

			}
		}
	}

}